; domain
(define (domain foodora_domain)
  (:requirements :strips :typing :adl)
  
  (:types node restaurant customer biker)
  
  (:predicates (edge ?node ?node)
               (at-r ?restaurant ?node)
			   (at-c ?customer ?node)
			   (at-b ?biker ?node)
			   (rGotFoodFor ?restaurant ?customer)
			   (bGotFoodFor ?biker ?customer)
			   (notHaveFood ?biker)
			   (gotFood ?customer))

  (:action move
    :parameters (?b - biker ?from - node ?to - node)
    :precondition (and (at-b ?b ?from) (edge ?from ?to))
    :effect (and (not (at-b ?b ?from)) (at-b ?b ?to))
   )

  (:action pickUpFood
    :parameters (?b - biker ?r - restaurant ?c - customer ?n - node)
    :precondition (and (at-b ?b ?n) (at-r ?r ?n) (notHaveFood ?b) (rGotFoodFor ?r ?c))
    :effect (and (not (notHaveFood ?b)) (bGotFoodFor ?b ?c) (not (rGotFoodFor ?r ?c)))
   )  
   
  (:action deliverFood
    :parameters (?b - biker ?c - customer ?n - node)
    :precondition (and (at-b ?b ?n) (at-c ?c ?n) (bGotFoodFor ?b ?c))
    :effect (and (notHaveFood ?b) (not (bGotFoodFor ?b ?c)) (gotFood ?c))
   )
   
 
 )

; problem
(define (problem test_problem)
  (:domain foodora_domain)
  (:objects c1 c2 c3 - customer
            r1 r2 r3 - restaurant
            b1 b2 b3 - biker
            n1 n2 n3 n4 n5 n6 - node)
  (:init 
  (at-c c1 n1)
  (at-c c2 n2)
  (at-c c3 n3)
  (at-r r1 n4)
  (at-r r2 n5)
  (at-r r3 n6)
  (edge n1 n2)
  (edge n2 n3)
  (edge n3 n4)
  (edge n4 n5)
  (edge n5 n6)
  (edge n6 n1)
  (at-b b1 n1)
  (at-b b2 n1)
  (at-b b3 n1)
  (rGotFoodFor r1 c1)
  (rGotFoodFor r2 c2)
  (rGotFoodFor r3 c3)
  (notHaveFood b1)
  (notHaveFood b2)
  (notHaveFood b3))
  (:goal (and (gotFood c1) (gotFood c2) (gotFood c3)))
  )

; plan
1. (move b2 n1 n2)
   deleted: (at-b b2 n1)
   added: (at-b b2 n2)
   goals met: 0 of 3
2. (move b2 n2 n3)
   deleted: (at-b b2 n2)
   added: (at-b b2 n3)
   goals met: 0 of 3
3. (move b2 n3 n4)
   deleted: (at-b b2 n3)
   added: (at-b b2 n4)
   goals met: 0 of 3
4. (move b2 n4 n5)
   deleted: (at-b b2 n4)
   added: (at-b b2 n5)
   goals met: 0 of 3
5. (move b2 n5 n6)
   deleted: (at-b b2 n5)
   added: (at-b b2 n6)
   goals met: 0 of 3
6. (pickupfood b2 r3 c3 n6)
   deleted: (nothavefood b2) (rgotfoodfor r3 c3)
   added: (bgotfoodfor b2 c3)
   goals met: 0 of 3
7. (move b2 n6 n1)
   deleted: (at-b b2 n6)
   added: (at-b b2 n1)
   goals met: 0 of 3
8. (move b2 n1 n2)
   deleted: (at-b b2 n1)
   added: (at-b b2 n2)
   goals met: 0 of 3
9. (move b2 n2 n3)
   deleted: (at-b b2 n2)
   added: (at-b b2 n3)
   goals met: 0 of 3
10. (deliverfood b2 c3 n3)
   deleted: (bgotfoodfor b2 c3)
   added: (nothavefood b2) (gotfood c3)
   goals met: 1 of 3
11. (move b2 n3 n4)
   deleted: (at-b b2 n3)
   added: (at-b b2 n4)
   goals met: 1 of 3
12. (move b2 n4 n5)
   deleted: (at-b b2 n4)
   added: (at-b b2 n5)
   goals met: 1 of 3
13. (pickupfood b2 r2 c2 n5)
   deleted: (nothavefood b2) (rgotfoodfor r2 c2)
   added: (bgotfoodfor b2 c2)
   goals met: 1 of 3
14. (move b2 n5 n6)
   deleted: (at-b b2 n5)
   added: (at-b b2 n6)
   goals met: 1 of 3
15. (move b2 n6 n1)
   deleted: (at-b b2 n6)
   added: (at-b b2 n1)
   goals met: 1 of 3
16. (move b2 n1 n2)
   deleted: (at-b b2 n1)
   added: (at-b b2 n2)
   goals met: 1 of 3
17. (deliverfood b2 c2 n2)
   deleted: (bgotfoodfor b2 c2)
   added: (nothavefood b2) (gotfood c2)
   goals met: 2 of 3
18. (move b2 n2 n3)
   deleted: (at-b b2 n2)
   added: (at-b b2 n3)
   goals met: 2 of 3
19. (move b2 n3 n4)
   deleted: (at-b b2 n3)
   added: (at-b b2 n4)
   goals met: 2 of 3
20. (pickupfood b2 r1 c1 n4)
   deleted: (nothavefood b2) (rgotfoodfor r1 c1)
   added: (bgotfoodfor b2 c1)
   goals met: 2 of 3
21. (move b2 n4 n5)
   deleted: (at-b b2 n4)
   added: (at-b b2 n5)
   goals met: 2 of 3
22. (move b2 n5 n6)
   deleted: (at-b b2 n5)
   added: (at-b b2 n6)
   goals met: 2 of 3
23. (move b2 n6 n1)
   deleted: (at-b b2 n6)
   added: (at-b b2 n1)
   goals met: 2 of 3
24. (deliverfood b2 c1 n1)
   deleted: (bgotfoodfor b2 c1)
   added: (nothavefood b2) (gotfood c1)
   goals met: 3 of 3
